In [151]:
import pandas as pd

In [152]:
# pd.set_option('display.max_rows',None)

In [153]:
df = pd.read_csv('Shark Tank India.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 78 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Season Number              478 non-null    int64
 1   Startup Name               478 non-null    object
 2   Episode Number             478 non-null    int64
 3   Pitch Number               478 non-null    int64
 4   Season Start               478 non-null    object
 5   Season End                 478 non-null    object
 6   Original Air Date          447 non-null    object
 7   Episode Title              478 non-null    object
 8   Anchor                     478 non-null    object
 9   Industry                   478 non-null    object
 10  Business Description       478 non-null    object
 11  Company Website            466 non-null    object
 12  Started in                 355 non-null    float64
 13  Number of Presenters       478 non-null    int64
 14  Male Presenters            412 non-null    float64
 15  Female Presenters          226 non-null    float64
 16  Transgender Presenters     3 non-null      float64
 17  Couple Presenters          473 non-null    float64
 18  Pitchers Average Age       478 non-null    object
 19  Pitchers City              473 non-null    object
 20  Pitchers State             474 non-null    object
 21  Yearly Revenue             241 non-null    float64
 22  Monthly Sales              225 non-null    float64
 23  Gross Margin               129 non-null    float64
 24  Net Margin                 73 non-null     float64
 25  EBITDA                     23 non-null     float64
 26  Cash Burn                  64 non-null     object
 27  SKUs                       28 non-null     float64
 28  Has Patents                43 non-null     object
 29  Bootstrapped               48 non-null     object
 30  Original Ask Amount        478 non-null    float64
 31  Original Offered Equity    478 non-null    float64
 32  Valuation Requested        478 non-null    float64
 33  Received Offer             478 non-null    int64
 34  Accepted Offer             321 non-null    float64
 35  Total Deal Amount          268 non-null    float64
 36  Total Deal Equity          268 non-null    float64
 37  Total Deal Debt            62 non-null     float64
 38  Debt Interest              45 non-null     float64
 39  Deal Valuation             267 non-null    float64
 40  Number of Sharks in Deal   268 non-null    float64
 41  Deal Has Conditions        26 non-null     object
 42  Royalty Deal               17 non-null     float64
 43  Advisory Shares Equity     3 non-null      float64
 44  Namita Investment Amount   89 non-null     float64
 45  Namita Investment Equity   89 non-null     float64
 46  Namita Debt Amount         17 non-null     float64
 47  Vineeta Investment Amount  68 non-null     float64
 48  Vineeta Investment Equity  68 non-null     float64
 49  Vineeta Debt Amount        12 non-null     float64
 50  Anupam Investment Amount   75 non-null     float64
 51  Anupam Investment Equity   75 non-null     float64
 52  Anupam Debt Amount         8 non-null      float64
 53  Aman Investment Amount     109 non-null    float64
 54  Aman Investment Equity     109 non-null    float64
 55  Aman Debt Amount           18 non-null     float64
 56  Peyush Investment Amount   89 non-null     float64
 57  Peyush Investment Equity   89 non-null     float64
 58  Peyush Debt Amount         12 non-null     float64
 59  Amit Investment Amount     35 non-null     float64
 60  Amit Investment Equity     35 non-null     float64
 61  Amit Debt Amount           7 non-null      float64
 62  Ashneer Investment Amount  21 non-null     float64
 63  Ashneer Investment Equity  21 non-null     float64
 64  Ashneer Debt Amount        2 non-null      float64
 65  Guest Investment Amount    48 non-null     float64
 66  Guest Investment Equity    48 non-null     float64
 67  Guest Debt Amount          9 non-null      float64
 68  Invested Guest Name        48 non-null     object
 69  All Guest Names            144 non-null    object
 70  Namita Present             389 non-null    float64
 71  Vineeta Present            318 non-null    float64
 72  Anupam Present             424 non-null    float64
 73  Aman Present               420 non-null    float64
 74  Peyush Present             307 non-null    float64
 75  Amit Present               137 non-null    float64
 76  Ashneer Present            99 non-null     float64
 77  Guest Present              144 non-null    float64
dtypes: float64(55), int64(5), object(18)
memory usage: 291.4+ KB

In [154]:
df.sample(5)

,Season Number,Startup Name,Episode Number,Pitch Number,Season Start,Season End,Original Air Date,Episode Title,Anchor,Industry,...,Invested Guest Name,All Guest Names,Namita Present,Vineeta Present,Anupam Present,Aman Present,Peyush Present,Amit Present,Ashneer Present,Guest Present
299,2,ZSportsTech,46,300,02-Jan-23,10-Mar-23,06-Mar-23,Different Colours Of Entrepreneurship,Rahul Dua,Sports,...,NaN,NaN,1.0,1.0,1.0,1.0,1.0,NaN,NaN,NaN
422,3,Sorich,34,423,22-Jan-24,31-Mar-24,07-Mar-24,Visionary Brands Shine Bright,Rahul Dua,Food,...,NaN,Azhar Iqubal,NaN,1.0,1.0,1.0,1.0,NaN,NaN,1.0
133,1,StanleeIndia,0,134,20-Dec-21,04-Feb-22,NaN,Unseen,Rannvijay Singh,Electronics,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
141,1,Tathastulive,0,142,20-Dec-21,04-Feb-22,NaN,Unseen,Rannvijay Singh,Services,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
387,3,Artinci,23,388,22-Jan-24,31-Mar-24,21-Feb-24,Celebrating Entrepreneurial Breakthroughs,Rahul Dua,Food,...,NaN,NaN,1.0,1.0,1.0,1.0,1.0,NaN,NaN,NaN

In [155]:
df.duplicated().sum()

0

In [156]:
df.isnull().sum() / df.shape[0]*100

Season Number       0.000000
Startup Name        0.000000
Episode Number      0.000000
Pitch Number        0.000000
Season Start        0.000000
                     ...
Aman Present       12.133891
Peyush Present     35.774059
Amit Present       71.338912
Ashneer Present    79.288703
Guest Present      69.874477
Length: 78, dtype: float64

In [157]:
df.isnull().sum().sum()

20305

In [158]:
df[df.select_dtypes('object').columns].fillna(df[df.select_dtypes('object').columns].mode(),inplace=True)

C:\Users\Aryan\AppData\Local\Temp\ipykernel_14884\2986338455.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df.select_dtypes('object').columns].fillna(df[df.select_dtypes('object').columns].mode(),inplace=True)

In [159]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 78 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Season Number              478 non-null    int64
 1   Startup Name               478 non-null    object
 2   Episode Number             478 non-null    int64
 3   Pitch Number               478 non-null    int64
 4   Season Start               478 non-null    object
 5   Season End                 478 non-null    object
 6   Original Air Date          447 non-null    object
 7   Episode Title              478 non-null    object
 8   Anchor                     478 non-null    object
 9   Industry                   478 non-null    object
 10  Business Description       478 non-null    object
 11  Company Website            466 non-null    object
 12  Started in                 355 non-null    float64
 13  Number of Presenters       478 non-null    int64
 14  Male Presenters            412 non-null    float64
 15  Female Presenters          226 non-null    float64
 16  Transgender Presenters     3 non-null      float64
 17  Couple Presenters          473 non-null    float64
 18  Pitchers Average Age       478 non-null    object
 19  Pitchers City              473 non-null    object
 20  Pitchers State             474 non-null    object
 21  Yearly Revenue             241 non-null    float64
 22  Monthly Sales              225 non-null    float64
 23  Gross Margin               129 non-null    float64
 24  Net Margin                 73 non-null     float64
 25  EBITDA                     23 non-null     float64
 26  Cash Burn                  64 non-null     object
 27  SKUs                       28 non-null     float64
 28  Has Patents                43 non-null     object
 29  Bootstrapped               48 non-null     object
 30  Original Ask Amount        478 non-null    float64
 31  Original Offered Equity    478 non-null    float64
 32  Valuation Requested        478 non-null    float64
 33  Received Offer             478 non-null    int64
 34  Accepted Offer             321 non-null    float64
 35  Total Deal Amount          268 non-null    float64
 36  Total Deal Equity          268 non-null    float64
 37  Total Deal Debt            62 non-null     float64
 38  Debt Interest              45 non-null     float64
 39  Deal Valuation             267 non-null    float64
 40  Number of Sharks in Deal   268 non-null    float64
 41  Deal Has Conditions        26 non-null     object
 42  Royalty Deal               17 non-null     float64
 43  Advisory Shares Equity     3 non-null      float64
 44  Namita Investment Amount   89 non-null     float64
 45  Namita Investment Equity   89 non-null     float64
 46  Namita Debt Amount         17 non-null     float64
 47  Vineeta Investment Amount  68 non-null     float64
 48  Vineeta Investment Equity  68 non-null     float64
 49  Vineeta Debt Amount        12 non-null     float64
 50  Anupam Investment Amount   75 non-null     float64
 51  Anupam Investment Equity   75 non-null     float64
 52  Anupam Debt Amount         8 non-null      float64
 53  Aman Investment Amount     109 non-null    float64
 54  Aman Investment Equity     109 non-null    float64
 55  Aman Debt Amount           18 non-null     float64
 56  Peyush Investment Amount   89 non-null     float64
 57  Peyush Investment Equity   89 non-null     float64
 58  Peyush Debt Amount         12 non-null     float64
 59  Amit Investment Amount     35 non-null     float64
 60  Amit Investment Equity     35 non-null     float64
 61  Amit Debt Amount           7 non-null      float64
 62  Ashneer Investment Amount  21 non-null     float64
 63  Ashneer Investment Equity  21 non-null     float64
 64  Ashneer Debt Amount        2 non-null      float64
 65  Guest Investment Amount    48 non-null     float64
 66  Guest Investment Equity    48 non-null     float64
 67  Guest Debt Amount          9 non-null      float64
 68  Invested Guest Name        48 non-null     object
 69  All Guest Names            144 non-null    object
 70  Namita Present             389 non-null    float64
 71  Vineeta Present            318 non-null    float64
 72  Anupam Present             424 non-null    float64
 73  Aman Present               420 non-null    float64
 74  Peyush Present             307 non-null    float64
 75  Amit Present               137 non-null    float64
 76  Ashneer Present            99 non-null     float64
 77  Guest Present              144 non-null    float64
dtypes: float64(55), int64(5), object(18)
memory usage: 291.4+ KB

In [160]:
df.columns

Index(['Season Number', 'Startup Name', 'Episode Number', 'Pitch Number',
       'Season Start', 'Season End', 'Original Air Date', 'Episode Title',
       'Anchor', 'Industry', 'Business Description', 'Company Website',
       'Started in', 'Number of Presenters', 'Male Presenters',
       'Female Presenters', 'Transgender Presenters', 'Couple Presenters',
       'Pitchers Average Age', 'Pitchers City', 'Pitchers State',
       'Yearly Revenue', 'Monthly Sales', 'Gross Margin', 'Net Margin',
       'EBITDA', 'Cash Burn', 'SKUs', 'Has Patents', 'Bootstrapped',
       'Original Ask Amount', 'Original Offered Equity', 'Valuation Requested',
       'Received Offer', 'Accepted Offer', 'Total Deal Amount',
       'Total Deal Equity', 'Total Deal Debt', 'Debt Interest',
       'Deal Valuation', 'Number of Sharks in Deal', 'Deal Has Conditions',
       'Royalty Deal', 'Advisory Shares Equity', 'Namita Investment Amount',
       'Namita Investment Equity', 'Namita Debt Amount',
       'Vineeta Investment Amount', 'Vineeta Investment Equity',
       'Vineeta Debt Amount', 'Anupam Investment Amount',
       'Anupam Investment Equity', 'Anupam Debt Amount',
       'Aman Investment Amount', 'Aman Investment Equity', 'Aman Debt Amount',
       'Peyush Investment Amount', 'Peyush Investment Equity',
       'Peyush Debt Amount', 'Amit Investment Amount',
       'Amit Investment Equity', 'Amit Debt Amount',
       'Ashneer Investment Amount', 'Ashneer Investment Equity',
       'Ashneer Debt Amount', 'Guest Investment Amount',
       'Guest Investment Equity', 'Guest Debt Amount', 'Invested Guest Name',
       'All Guest Names', 'Namita Present', 'Vineeta Present',
       'Anupam Present', 'Aman Present', 'Peyush Present', 'Amit Present',
       'Ashneer Present', 'Guest Present'],
      dtype='object')

In [161]:
df.drop(columns=['Season Number','Episode Number', 'Pitch Number',
       'Season Start', 'Season End', 'Original Air Date', 'Episode Title',
       'Anchor', 'Namita Present', 'Vineeta Present',
       'Anupam Present', 'Aman Present', 'Peyush Present', 'Amit Present',
       'Ashneer Present', 'Guest Present'],inplace=True)

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 62 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Startup Name               478 non-null    object
 1   Industry                   478 non-null    object
 2   Business Description       478 non-null    object
 3   Company Website            466 non-null    object
 4   Started in                 355 non-null    float64
 5   Number of Presenters       478 non-null    int64
 6   Male Presenters            412 non-null    float64
 7   Female Presenters          226 non-null    float64
 8   Transgender Presenters     3 non-null      float64
 9   Couple Presenters          473 non-null    float64
 10  Pitchers Average Age       478 non-null    object
 11  Pitchers City              473 non-null    object
 12  Pitchers State             474 non-null    object
 13  Yearly Revenue             241 non-null    float64
 14  Monthly Sales              225 non-null    float64
 15  Gross Margin               129 non-null    float64
 16  Net Margin                 73 non-null     float64
 17  EBITDA                     23 non-null     float64
 18  Cash Burn                  64 non-null     object
 19  SKUs                       28 non-null     float64
 20  Has Patents                43 non-null     object
 21  Bootstrapped               48 non-null     object
 22  Original Ask Amount        478 non-null    float64
 23  Original Offered Equity    478 non-null    float64
 24  Valuation Requested        478 non-null    float64
 25  Received Offer             478 non-null    int64
 26  Accepted Offer             321 non-null    float64
 27  Total Deal Amount          268 non-null    float64
 28  Total Deal Equity          268 non-null    float64
 29  Total Deal Debt            62 non-null     float64
 30  Debt Interest              45 non-null     float64
 31  Deal Valuation             267 non-null    float64
 32  Number of Sharks in Deal   268 non-null    float64
 33  Deal Has Conditions        26 non-null     object
 34  Royalty Deal               17 non-null     float64
 35  Advisory Shares Equity     3 non-null      float64
 36  Namita Investment Amount   89 non-null     float64
 37  Namita Investment Equity   89 non-null     float64
 38  Namita Debt Amount         17 non-null     float64
 39  Vineeta Investment Amount  68 non-null     float64
 40  Vineeta Investment Equity  68 non-null     float64
 41  Vineeta Debt Amount        12 non-null     float64
 42  Anupam Investment Amount   75 non-null     float64
 43  Anupam Investment Equity   75 non-null     float64
 44  Anupam Debt Amount         8 non-null      float64
 45  Aman Investment Amount     109 non-null    float64
 46  Aman Investment Equity     109 non-null    float64
 47  Aman Debt Amount           18 non-null     float64
 48  Peyush Investment Amount   89 non-null     float64
 49  Peyush Investment Equity   89 non-null     float64
 50  Peyush Debt Amount         12 non-null     float64
 51  Amit Investment Amount     35 non-null     float64
 52  Amit Investment Equity     35 non-null     float64
 53  Amit Debt Amount           7 non-null      float64
 54  Ashneer Investment Amount  21 non-null     float64
 55  Ashneer Investment Equity  21 non-null     float64
 56  Ashneer Debt Amount        2 non-null      float64
 57  Guest Investment Amount    48 non-null     float64
 58  Guest Investment Equity    48 non-null     float64
 59  Guest Debt Amount          9 non-null      float64
 60  Invested Guest Name        48 non-null     object
 61  All Guest Names            144 non-null    object
dtypes: float64(47), int64(2), object(13)
memory usage: 231.7+ KB

In [163]:
df.isnull().sum().sum()

18688

In [164]:
df.shape

(478, 62)

In [165]:
df.sample(5)

,Startup Name,Industry,Business Description,Company Website,Started in,Number of Presenters,Male Presenters,Female Presenters,Transgender Presenters,Couple Presenters,...,Amit Investment Equity,Amit Debt Amount,Ashneer Investment Amount,Ashneer Investment Equity,Ashneer Debt Amount,Guest Investment Amount,Guest Investment Equity,Guest Debt Amount,Invested Guest Name,All Guest Names
216,Broomees,Services,Helpers homemakers for your home,https://broomees.com/,NaN,3,2.0,1.0,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
467,KioskKaffee,Liquor/Beverages,Premium Coffee,https://kiosk-kaffee.com/,2020.0,3,3.0,NaN,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Azhar Iqubal
38,Carragreen,Manufacturing,Eco-Friendly boxes,https://carragreen.com/,2018.0,2,NaN,2.0,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
269,DesmondJi,Liquor/Beverages,"Spirits, Liqueurs & Cocktail Blends",NaN,NaN,2,2.0,NaN,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
240,MindPeers,Medical/Health,For Mental Strength,https://www.mindpeers.co/,NaN,2,1.0,1.0,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [166]:
df.isnull().sum()

Startup Name                 0
Industry                     0
Business Description         0
Company Website             12
Started in                 123
                          ...
Guest Investment Amount    430
Guest Investment Equity    430
Guest Debt Amount          469
Invested Guest Name        430
All Guest Names            334
Length: 62, dtype: int64

In [167]:
df.select_dtypes('object').columns

Index(['Startup Name', 'Industry', 'Business Description', 'Company Website',
       'Pitchers Average Age', 'Pitchers City', 'Pitchers State', 'Cash Burn',
       'Has Patents', 'Bootstrapped', 'Deal Has Conditions',
       'Invested Guest Name', 'All Guest Names'],
      dtype='object')

In [168]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 62 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Startup Name               478 non-null    object
 1   Industry                   478 non-null    object
 2   Business Description       478 non-null    object
 3   Company Website            466 non-null    object
 4   Started in                 355 non-null    float64
 5   Number of Presenters       478 non-null    int64
 6   Male Presenters            412 non-null    float64
 7   Female Presenters          226 non-null    float64
 8   Transgender Presenters     3 non-null      float64
 9   Couple Presenters          473 non-null    float64
 10  Pitchers Average Age       478 non-null    object
 11  Pitchers City              473 non-null    object
 12  Pitchers State             474 non-null    object
 13  Yearly Revenue             241 non-null    float64
 14  Monthly Sales              225 non-null    float64
 15  Gross Margin               129 non-null    float64
 16  Net Margin                 73 non-null     float64
 17  EBITDA                     23 non-null     float64
 18  Cash Burn                  64 non-null     object
 19  SKUs                       28 non-null     float64
 20  Has Patents                43 non-null     object
 21  Bootstrapped               48 non-null     object
 22  Original Ask Amount        478 non-null    float64
 23  Original Offered Equity    478 non-null    float64
 24  Valuation Requested        478 non-null    float64
 25  Received Offer             478 non-null    int64
 26  Accepted Offer             321 non-null    float64
 27  Total Deal Amount          268 non-null    float64
 28  Total Deal Equity          268 non-null    float64
 29  Total Deal Debt            62 non-null     float64
 30  Debt Interest              45 non-null     float64
 31  Deal Valuation             267 non-null    float64
 32  Number of Sharks in Deal   268 non-null    float64
 33  Deal Has Conditions        26 non-null     object
 34  Royalty Deal               17 non-null     float64
 35  Advisory Shares Equity     3 non-null      float64
 36  Namita Investment Amount   89 non-null     float64
 37  Namita Investment Equity   89 non-null     float64
 38  Namita Debt Amount         17 non-null     float64
 39  Vineeta Investment Amount  68 non-null     float64
 40  Vineeta Investment Equity  68 non-null     float64
 41  Vineeta Debt Amount        12 non-null     float64
 42  Anupam Investment Amount   75 non-null     float64
 43  Anupam Investment Equity   75 non-null     float64
 44  Anupam Debt Amount         8 non-null      float64
 45  Aman Investment Amount     109 non-null    float64
 46  Aman Investment Equity     109 non-null    float64
 47  Aman Debt Amount           18 non-null     float64
 48  Peyush Investment Amount   89 non-null     float64
 49  Peyush Investment Equity   89 non-null     float64
 50  Peyush Debt Amount         12 non-null     float64
 51  Amit Investment Amount     35 non-null     float64
 52  Amit Investment Equity     35 non-null     float64
 53  Amit Debt Amount           7 non-null      float64
 54  Ashneer Investment Amount  21 non-null     float64
 55  Ashneer Investment Equity  21 non-null     float64
 56  Ashneer Debt Amount        2 non-null      float64
 57  Guest Investment Amount    48 non-null     float64
 58  Guest Investment Equity    48 non-null     float64
 59  Guest Debt Amount          9 non-null      float64
 60  Invested Guest Name        48 non-null     object
 61  All Guest Names            144 non-null    object
dtypes: float64(47), int64(2), object(13)
memory usage: 231.7+ KB

In [169]:
# df.drop(columns=)
thrs = df.shape[0] * 0.4

In [170]:
df = df.dropna(thresh=thrs, axis=1)

In [171]:
df.isnull().sum() / df.shape[0]*100

Startup Name                 0.000000
Industry                     0.000000
Business Description         0.000000
Company Website              2.510460
Started in                  25.732218
Number of Presenters         0.000000
Male Presenters             13.807531
Female Presenters           52.719665
Couple Presenters            1.046025
Pitchers Average Age         0.000000
Pitchers City                1.046025
Pitchers State               0.836820
Yearly Revenue              49.581590
Monthly Sales               52.928870
Original Ask Amount          0.000000
Original Offered Equity      0.000000
Valuation Requested          0.000000
Received Offer               0.000000
Accepted Offer              32.845188
Total Deal Amount           43.933054
Total Deal Equity           43.933054
Deal Valuation              44.142259
Number of Sharks in Deal    43.933054
dtype: float64

In [172]:
ob_col = df.select_dtypes("object").columns

In [173]:
df[ob_col] = df[ob_col].fillna(df[ob_col].mode().iloc[0])
# df[ob_col.to_list()].mode().iloc[0]
# df[ob_col.to_list()]
# ob_col.to_list()

In [174]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 23 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Startup Name              478 non-null    object
 1   Industry                  478 non-null    object
 2   Business Description      478 non-null    object
 3   Company Website           478 non-null    object
 4   Started in                355 non-null    float64
 5   Number of Presenters      478 non-null    int64
 6   Male Presenters           412 non-null    float64
 7   Female Presenters         226 non-null    float64
 8   Couple Presenters         473 non-null    float64
 9   Pitchers Average Age      478 non-null    object
 10  Pitchers City             478 non-null    object
 11  Pitchers State            478 non-null    object
 12  Yearly Revenue            241 non-null    float64
 13  Monthly Sales             225 non-null    float64
 14  Original Ask Amount       478 non-null    float64
 15  Original Offered Equity   478 non-null    float64
 16  Valuation Requested       478 non-null    float64
 17  Received Offer            478 non-null    int64
 18  Accepted Offer            321 non-null    float64
 19  Total Deal Amount         268 non-null    float64
 20  Total Deal Equity         268 non-null    float64
 21  Deal Valuation            267 non-null    float64
 22  Number of Sharks in Deal  268 non-null    float64
dtypes: float64(14), int64(2), object(7)
memory usage: 86.0+ KB

In [175]:
num_col = df.select_dtypes(['int','float']).columns

In [176]:
# df[num_col] = df[num_col].fillna(df[num_col].median().iloc[0])
df[num_col].median()

Started in                  2019.000000
Number of Presenters           2.000000
Male Presenters                1.000000
Female Presenters              1.000000
Couple Presenters              0.000000
Yearly Revenue               170.000000
Monthly Sales                 21.000000
Original Ask Amount           75.000000
Original Offered Equity        2.500000
Valuation Requested         2857.071428
Received Offer                 1.000000
Accepted Offer                 1.000000
Total Deal Amount             56.300000
Total Deal Equity              5.000000
Deal Valuation              1107.692308
Number of Sharks in Deal       2.000000
dtype: float64

In [179]:
df[num_col].mean()

Started in                  2018.904225
Number of Presenters           2.020921
Male Presenters                1.679612
Female Presenters              1.199115
Couple Presenters              0.177590
Yearly Revenue               557.033195
Monthly Sales                 68.917253
Original Ask Amount          144.451284
Original Offered Equity        3.811987
Valuation Requested         5245.346384
Received Offer                 0.671548
Accepted Offer                 0.834891
Total Deal Amount             66.177663
Total Deal Equity              8.278694
Deal Valuation              2280.644650
Number of Sharks in Deal       2.011194
dtype: float64

In [177]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 23 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Startup Name              478 non-null    object
 1   Industry                  478 non-null    object
 2   Business Description      478 non-null    object
 3   Company Website           478 non-null    object
 4   Started in                355 non-null    float64
 5   Number of Presenters      478 non-null    int64
 6   Male Presenters           412 non-null    float64
 7   Female Presenters         226 non-null    float64
 8   Couple Presenters         473 non-null    float64
 9   Pitchers Average Age      478 non-null    object
 10  Pitchers City             478 non-null    object
 11  Pitchers State            478 non-null    object
 12  Yearly Revenue            241 non-null    float64
 13  Monthly Sales             225 non-null    float64
 14  Original Ask Amount       478 non-null    float64
 15  Original Offered Equity   478 non-null    float64
 16  Valuation Requested       478 non-null    float64
 17  Received Offer            478 non-null    int64
 18  Accepted Offer            321 non-null    float64
 19  Total Deal Amount         268 non-null    float64
 20  Total Deal Equity         268 non-null    float64
 21  Deal Valuation            267 non-null    float64
 22  Number of Sharks in Deal  268 non-null    float64
dtypes: float64(14), int64(2), object(7)
memory usage: 86.0+ KB

In [178]:
df.isnull().sum()

Startup Name                  0
Industry                      0
Business Description          0
Company Website               0
Started in                  123
Number of Presenters          0
Male Presenters              66
Female Presenters           252
Couple Presenters             5
Pitchers Average Age          0
Pitchers City                 0
Pitchers State                0
Yearly Revenue              237
Monthly Sales               253
Original Ask Amount           0
Original Offered Equity       0
Valuation Requested           0
Received Offer                0
Accepted Offer              157
Total Deal Amount           210
Total Deal Equity           210
Deal Valuation              211
Number of Sharks in Deal    210
dtype: int64